/******************************************
 * @name 逼哩逼哩🚗
 * @channel https://t.me/yqc_123
 * @feedback https://t.me/yqc_777
 * @version 1.0.2
******************************************
# 逼哩逼哩

## 更新日志

### 20211005

    修复短视频无法播放问题

### 20231018

    1.更换解锁密钥
    2.更换接口路径

## 脚本注明

1. 脚本只是针对基于 Quantumult X 等工具对 Javascript 和 WEB 逆向的学习，不得用于商业用途，否则后果自负。
2. 不保证脚本合法性、准确性、有效性，请根据情况自行判断，本人对此不承担任何保证责任。
3. 本人对任何脚本引发的问题概不负责，包括但不限于由脚本错误引起的任何损失和损害。
4. 转载脚本请注明来源，欢迎分享，拒绝倒卖，倒卖 🐕 必死 🐎。
5. 如果任何单位或个人认为此脚本可能涉嫌侵犯其权利，应及时通知并提供身份证明，所有权证明，我们将在收到认证文件确认后删除此脚本。
6. 所有直接或间接使用、查看此脚本的人均应该仔细阅读此声明, 本人保留随时更改或补充此声明的权利, 一旦您使用或复制了此脚本，即视为您已接受此免责声明。
7. 欢迎对[本仓库](https://github.com/Yuheng0101/X)Star✅，但请不要 Fork❌。

## 使用方法

> Quantumult X

    在打开 `资源解析器` 的前提下直接添加重写

> Other

- 方法一: 有能力者自行将重写规则添加至配置文件

- 方法二: 使用 `Script Hub` 模块转换脚本

## 脚本描述

    1.解锁VIP、金币视频
    2.解锁个人中心

## 下载地址

    逼哩逼哩: https://ee.6u7ou63.cc/?pc=S4DMAXDG

******************************************

hostname=*3m5sbs*,*yrvguhx*,*cbsbwr*,*hxcwqh*,*nocqvbo*,*5wxksg*,*bqisxzq*,*mdy069p*

^http[s]?:\/\/.*(3m5sbs|yrvguhx|cbsbwr|hxcwqh|nocqvbo|5wxksg|bqisxzq|mdy069p).*api\/app/(ping\/config|media\/home|user\/info|media\/play|comics\/detail|post\/list) url script-response-body https://raw.githubusercontent.com/Yuheng0101/X/main/Scripts/mdsq.js

******************************************/











































































// Adding a dummy sgmodule commit(29)
// Adding a dummy plugin commit(27)
// Adding a dummy stoverride commit(24)
